export const linesData = {
  city: [
    { name: '美国', value: [-118.24311, 34.052713] },
    { name: '澳大利亚', value: [149.08, -35.15] },
    { name: '以色列', value: [35.12, 31.47] },
    { name: '巴西', value: [-48.678945, -10.493623] },
    { name: '泰国', value: [100.35, 13.45] },
    { name: '沙特阿拉伯', value: [46.42, 24.41] },
    { name: '新加坡', value: [103.51, 1.18] },
    { name: '新西兰', value: [174.46, -41.19] },
    { name: '阿根廷', value: [-60.0, -36.3] },
    { name: '埃塞俄比亚', value: [38.42, 9.02] },
    { name: '哥伦比亚', value: [-74.0, 4.34] },
  ],
  moveLines: [
    {
      fromName: '长春',
      toName: '美国',
      coords: [
        [125.299633, 43.914039],
        [-118.24311, 34.052713],
      ],
    },
    {
      fromName: '长春',
      toName: '澳大利亚',
      coords: [
        [125.299633, 43.914039],
        [149.08, -35.15],
      ],
    },
    {
      fromName: '长春',
      toName: '以色列',
      coords: [
        [125.299633, 43.914039],
        [35.12, 31.47],
      ],
    },
    {
      fromName: '长春',
      toName: '巴西',
      coords: [
        [125.299633, 43.914039],
        [-48.678945, -10.493623],
      ],
    },
    {
      fromName: '长春',
      toName: '泰国',
      coords: [
        [125.299633, 43.914039],
        [100.35, 13.45],
      ],
    },
    {
      fromName: '长春',
      toName: '沙特阿拉伯',
      coords: [
        [125.299633, 43.914039],
        [46.42, 24.41],
      ],
    },
    {
      fromName: '长春',
      toName: '新加坡',
      coords: [
        [125.299633, 43.914039],
        [103.51, 1.18],
      ],
    },
    {
      fromName: '长春',
      toName: '新西兰',
      coords: [
        [125.299633, 43.914039],
        [174.46, -41.19],
      ],
    },
    {
      fromName: '长春',
      toName: '阿根廷',
      coords: [
        [125.299633, 43.914039],
        [-60.0, -36.3],
      ],
    },
    {
      fromName: '长春',
      toName: '埃塞俄比亚',
      coords: [
        [125.299633, 43.914039],
        [38.42, 9.02],
      ],
    },
    {
      fromName: '长春',
      toName: '哥伦比亚',
      coords: [
        [125.299633, 43.914039],
        [-74.0, 4.34],
      ],
    },
  ],
};
